<b>Exercice 1:</b>

Soit le fichier `employes2.csv`, qui contient les données d'employés : nom, age, département et salaire.

Vous allez répondre aux questions suivantes avce le code necessaire.

<u>Prerequis:</u>
- Charger un fichier CSV sous la forme d'un dataframe avec `pd.read_csv()`
- L'indexation et le slicing avec les opérateurs `iloc[]` et `loc[]`
- Fonction `mean()` sur serie
- Filtrage avec la fonction `query()`
- Filtrage avec l'opérateur `loc[]` et l'expression `lambda`

1. Charger les données de fichier tel que la première colonne joue le rôle de l'id des employés

In [8]:
import pandas as pd
df_employes=pd.read_csv("C:\\Users\\INFO\\Downloads\\employes2.csv" ,index_col=0)
df_employes

         age departement  salaire
nom
Alice     30          RH    50000
Bob       25   Marketing    60000
Charlie   35     Finance    70000
David     40          IT    80000
Eve       28          RH    55000
Ralf      41          RH    60000

2. Extraire Age et Salaire de deux derniers employés

In [9]:
# Utiliser iloc puis loc
#?
rows=df_employes.iloc[-2:,:]
rows.loc[:,['age','salaire']]

      age  salaire
nom
Eve    28    55000
Ralf   41    60000

3. Extraire les noms des employes de departement RH seulement

In [14]:
# en utilisant query() puis index
noms_rh=df_employes.query('departement=="RH"').index
noms_rh

Index(['Alice', 'Eve', 'Ralf'], dtype='object', name='nom')

In [16]:
# en utilisant loc + expr. lambda puis index
noms_rh=df_employes.loc[lambda x:x['departement']=='RH'].index
noms_rh

Index(['Alice', 'Eve', 'Ralf'], dtype='object', name='nom')

4. En déduire l'age moyen des employés de departement RH

In [19]:
# Utiliser loc puis mean
age_m=df_employes.loc[noms_rh,'age'].mean()
age_m

33.0

5. En déduire les noms des employés de dep RH dont l'age est dessus de la moyenne

In [25]:
# En utilisant loc puis query() puis index
#?
df_employes.loc[noms_rh,:].query('age>@age_m').index

Index(['Ralf'], dtype='object', name='nom')

In [27]:
# En utilisant loc puis loc puis lambda puis index
#?
df_employes.loc[noms_rh,:].loc[lambda e: e['age']>age_m].index

Index(['Ralf'], dtype='object', name='nom')

6. En déduire les noms des employés de dep RH dont l'age est dessous de la moyenne

In [28]:
# En utilisant loc + query() puis index
df_employes.loc[noms_rh,:].query('age<@age_m').index

Index(['Alice', 'Eve'], dtype='object', name='nom')

In [29]:
# En utilisant loc + loc + lambda puis index
df_employes.loc[noms_rh,:].loc[lambda e : (e['age']<age_m)].index

Index(['Alice', 'Eve'], dtype='object', name='nom')

<b>Exercice 2 : </b>

Selon  l'Institut National de la Météorologie , la température menseulle moyenne en (°C) en Tunisie à 2023-2024 est :

        Mois	T. moy
        Janvier	11,3
        Février	12,7
        Mars	15,2
        Avril	18,1
        Mai	        21,4
        Juin	25,2
        Juillet	32,6
        Août	31,9
        Septembre	28,4
        Octobre	24,3
        Novembre	18,7
        Décembre	14,4

On veut déterminer :
- le mois auquel on a la température minimale ?
- le mois auquel on a la température maximale ?
- le nombre de mois dont la témpérature est-dessous de la moyenne annuelle ?
- le nombre de mois dont la témpérature est-dessus de la moyenne annuelle ?

Charger les données à partir de CSV

In [30]:
df_temp=pd.read_csv("C:\\Users\\INFO\\Downloads\\temperatures.csv")
df_temp

     mois  temperature
0   01-23         11.3
1   02-23         12.7
2   03-23         15.2
3   04-23         18.1
4   05-23         21.4
5   06-23         25.2
6   07-23         32.6
7   08-23         31.9
8   09-23         28.4
9   10-23         24.3
10  11-23         18.7
11  12-23         14.4

Convertir la colonne 'mois' en type et format adéquat.

Pour le faire, utiliser la fonction `pd.to_datetime()` et lui passer :
- la série contenant les valeurs des dates comem chaines de caractères
- format de mois-année : `'%m/%y'`

In [34]:
df_temp['mois']=pd.to_datetime(df_temp['mois'],format='%m-%y')
df_temp['mois']

0    2023-01-01
1    2023-02-01
2    2023-03-01
3    2023-04-01
4    2023-05-01
5    2023-06-01
6    2023-07-01
7    2023-08-01
8    2023-09-01
9    2023-10-01
10   2023-11-01
11   2023-12-01
Name: mois, dtype: datetime64[ns]

Rendre la colonne 'mois' l'index de dataframe

In [41]:
# Utilsier set_index
df_temp.set_index('mois',inplace=True)
df_temp

            temperature
mois
2023-01-01         11.3
2023-02-01         12.7
2023-03-01         15.2
2023-04-01         18.1
2023-05-01         21.4
2023-06-01         25.2
2023-07-01         32.6
2023-08-01         31.9
2023-09-01         28.4
2023-10-01         24.3
2023-11-01         18.7
2023-12-01         14.4

Récupérer dans une serie `s_temp_triee` la colonne 'temeprature' triée par ordre décroissant de témpérature

In [45]:
# Utiliser sort_values avec l'argument ascending=False
s_temp_triee=df_temp['temperature'].sort_values(ascending=False)
s_temp_triee

mois
2023-07-01    32.6
2023-08-01    31.9
2023-09-01    28.4
2023-06-01    25.2
2023-10-01    24.3
2023-05-01    21.4
2023-11-01    18.7
2023-04-01    18.1
2023-03-01    15.2
2023-12-01    14.4
2023-02-01    12.7
2023-01-01    11.3
Name: temperature, dtype: float64

A partir de `s_temp_triee`, afficher les noms des mois triès par ordre décroissant de leurs témpératures

Note : Penser à utiliser la fonction `strftime()`

In [51]:
#?
list(s_temp_triee.index.strftime('%B'))

['July',
 'August',
 'September',
 'June',
 'October',
 'May',
 'November',
 'April',
 'March',
 'December',
 'February',
 'January']

Calculer la témpérature moyenne

In [53]:
temp_mean=df_temp['temperature'].mean()
temp_mean

21.183333333333334

Déterminer le nombre des mois ayant une température > témpérature moyenne

In [56]:
# Utiliser query() et len()
#?
len(df_temp.query('temperature>@temp_mean'))

6

In [57]:
# Utiliser loc + lambda et len()
#?
len(df_temp.loc[lambda t:t['temperature']>temp_mean])

6

<b>Exercice 3:</b>

1. Charger les employés à partir de fichier CSV `employes.csv` tel que la colonne `nom` est l'index

In [58]:
import pandas as pd

df_employes=pd.read_csv("C:\\Users\\INFO\\Downloads\\employes.csv",index_col='nom')
df_employes

       age  salaire
nom
Ali     28  1200.65
Sonia   30  2100.76
Rahma   25  1500.98
Walid   41  2500.76

1. Déterminer l'employé ayant l'age maximal :

In [61]:
#salaire maximal
sm = df_employes['salaire'].max()
sm

2500.76

2. En déduire le nom de l'employé ayant le salaire max

In [75]:
# methode 1 avec query() + index
df_employes.query('salaire==@sm').index[0]

'Walid'

In [76]:
# methode 2 : avec loc + lambda + index
df_employes.loc[lambda em: em['salaire']==sm].index[0]

'Walid'

3. Extraire la colonne 'salaire' comme étant série `s_salaire`

In [81]:
s_salaire=df_employes['salaire']
s_salaire

nom
Ali      1200.65
Sonia    2100.76
Rahma    1500.98
Walid    2500.76
Name: salaire, dtype: float64

4. En déduire le nom de l'employé ayant le salaire max :

In [86]:
# utiliser argmax pour déterminer l'indice
import numpy as np
indice=np.argmax(s_salaire)
indice

3

In [85]:
# Déterminer le nom à partir de index
s_salaire.index[indice]

'Walid'

In [89]:
# Utiliser directement la fonction idxmax()
s_salaire.idxmax()

'Walid'